Data Loading, Storage, and File Formats
-
- Topic Reading and Writing Data in Text Format
- Parsing functions in pandas

- read_csv = load delimited data from a file, URL, or file-like
- object; use comma as default delimiter

- read_excel = Read tabular data from an Excel XLS or XLSX file
- read_html = Read all tables found in the given HTML document

common options in these functions
-
- Indexing
Can treat one or more columns as the returned DataFrame, and whether to get column names from the file, the user, or not at all.

- Type inference and data conversion
This includes the user-defined value conversions and custom list of missing value markers.

- Datetime parsing
Includes combining capability, including combining date and time information spread over multiple columns into a single column in the result.

- Iterating
Support for iterating over chunks of very large files.

- Unclean data issues
Skipping rows or a footer, comments, or other minor things like numeric data with thousands separated by commas.

# loading it into pandas data frame

In [2]:
import pandas as pd

In [6]:
sample_df= pd.read_csv("/examples/sample.csv")
print(sample_df)

  studentid         name   chimestry   physics   english   math
0       A01     arif ali          20        30        40     50
1       A02  kamran khan          30        40        50     60
2       A03   imran ali           40        50        60     70
3       A04  kashif khan          50        60        70     80

In [4]:
sample_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   studentid   4 non-null      object
 1    name       4 non-null      object
 2    chimestry  4 non-null      int64
 3    physics    4 non-null      int64
 4    english    4 non-null      int64
 5    math       4 non-null      int64
dtypes: int64(4), object(2)
memory usage: 320.0+ bytes

we can change the column names while loading data
-

In [8]:
#  change the column names while loading data

sample_df=pd.read_csv("/examples/sample.csv",skiprows=1,
                     names=['id', 'name', 'ch', 'ph', 'en', 'math'])
print(sample_df)

    id         name  ch  ph  en  math
0  A01     arif ali  20  30  40    50
1  A02  kamran khan  30  40  50    60
2  A03   imran ali   40  50  60    70
3  A04  kashif khan  50  60  70    80

# Handling Missing Values

In [9]:
result = pd.read_csv('/examples/sample3.csv')
print(result)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [11]:
#changing data while loading in dataframe

#diconary=  column name : [source values, target value]#

sentinels = {'message':   ['foo',             'NA']}

pd.read_csv('/examples/sample3.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

-  By default, pandas uses a set of commonly occurring sentinels, such as NA and NULL

# Reading and Text Files in Pieces

In [12]:
data =pd.read_csv('/datasets/train.csv')
print(data)

      battery_power  blue  clock_speed  dual_sim  fc  four_g  int_memory  \
0               842     0          2.2         0   1       0           7
1              1021     1          0.5         1   0       1          53
2               563     1          0.5         1   2       1          41
3               615     1          2.5         0   0       0          10
4              1821     1          1.2         0  13       1          44
...             ...   ...          ...       ...  ..     ...         ...
1995            794     1          0.5         1   0       1           2
1996           1965     1          2.6         1   0       0          39
1997           1911     0          0.9         1   1       1          36
1998           1512     0          0.9         0   4       1          46
1999            510     1          2.0         1   5       1          45

      m_dep  mobile_wt  n_cores  ...  px_height  px_width   ram  sc_h  sc_w  \
0       0.6        188        2  ...         20       756  2549     9     7
1       0.7        136        3  ...        905      1988  2631    17     3
2       0.9        145        5  ...       1263      1716  2603    11     2
3       0.8        131        6  ...       1216      1786  2769    16     8
4       0.6        141        2  ...       1208      1212  1411     8     2
...     ...        ...      ...  ...        ...       ...   ...   ...   ...
1995    0.8        106        6  ...       1222      1890   668    13     4
1996    0.2        187        4  ...        915      1965  2032    11    10
1997    0.7        108        8  ...        868      1632  3057     9     1
1998    0.1        145        5  ...        336       670   869    18    10
1999    0.9        168        6  ...        483       754  3919    19     4

      talk_time  three_g  touch_screen  wifi  price_range
0            19        0             0     1            1
1             7        1             1     0            2
2             9        1             1     0            2
3            11        1             0     0            2
4            15        1             1     0            1
...         ...      ...           ...   ...          ...
1995         19        1             1     0            0
1996         16        1             1     1            2
1997          5        1             1     0            3
1998         19        1             1     1            0
1999          2        1             1     1            3

[2000 rows x 21 columns]

In [14]:
data.head()

,battery_power,blue,clock_speed,dual_sim,fc,four_g,int_memory,m_dep,mobile_wt,n_cores,...,px_height,px_width,ram,sc_h,sc_w,talk_time,three_g,touch_screen,wifi,price_range
0,842,0,2.2,0,1,0,7,0.6,188,2,...,20,756,2549,9,7,19,0,0,1,1
1,1021,1,0.5,1,0,1,53,0.7,136,3,...,905,1988,2631,17,3,7,1,1,0,2
2,563,1,0.5,1,2,1,41,0.9,145,5,...,1263,1716,2603,11,2,9,1,1,0,2
3,615,1,2.5,0,0,0,10,0.8,131,6,...,1216,1786,2769,16,8,11,1,0,0,2
4,1821,1,1.2,0,13,1,44,0.6,141,2,...,1208,1212,1411,8,2,15,1,1,0,1

In [13]:
#extracting selected rows from a large datasets
data =pd.read_csv('/datasets/train.csv', nrows=200)

In [14]:
print(data)

     battery_power  blue  clock_speed  dual_sim  fc  four_g  int_memory  \
0              842     0          2.2         0   1       0           7
1             1021     1          0.5         1   0       1          53
2              563     1          0.5         1   2       1          41
3              615     1          2.5         0   0       0          10
4             1821     1          1.2         0  13       1          44
..             ...   ...          ...       ...  ..     ...         ...
195           1526     0          2.1         0   1       1          23
196           1989     0          2.5         1   0       1          41
197           1308     0          1.9         0   0       1          61
198            609     0          0.5         0   3       0          26
199           1905     0          0.6         1   9       1          36

     m_dep  mobile_wt  n_cores  ...  px_height  px_width   ram  sc_h  sc_w  \
0      0.6        188        2  ...         20       756  2549     9     7
1      0.7        136        3  ...        905      1988  2631    17     3
2      0.9        145        5  ...       1263      1716  2603    11     2
3      0.8        131        6  ...       1216      1786  2769    16     8
4      0.6        141        2  ...       1208      1212  1411     8     2
..     ...        ...      ...  ...        ...       ...   ...   ...   ...
195    0.2        117        7  ...        718       751  2227    18    10
196    0.8         94        3  ...       1100      1497  1665    17     9
197    0.7        106        3  ...         59      1215  3355    15     2
198    0.3         93        4  ...        938      1948  1866    11    10
199    0.4        119        3  ...        825      1542  1287    13     4

     talk_time  three_g  touch_screen  wifi  price_range
0           19        0             0     1            1
1            7        1             1     0            2
2            9        1             1     0            2
3           11        1             0     0            2
4           15        1             1     0            1
..         ...      ...           ...   ...          ...
195          3        1             1     0            2
196         12        1             1     1            2
197          4        1             0     1            3
198         14        1             1     1            1
199         16        1             0     0            1

[200 rows x 21 columns]

Chunks mean 2000 rows loads or reads in 10 chunks because each chunks has read 200 rows
-

In [15]:
#To read a file in pieces, specify a chunksize as a number of rows:

chunks = pd.read_csv('/datasets/train.csv', chunksize=200)
print(type(chunks), print(chunks) )

<pandas.io.parsers.readers.TextFileReader object at 0x0000027AD09F5E10>
<class 'pandas.io.parsers.readers.TextFileReader'> None

In [17]:

chunks = pd.read_csv('/datasets/train.csv', chunksize=200)

chunkList = []
for chunk in chunks:
    chunkList.append(chunk)
    
    
#print(chunkList) 

df = chunkList[0] 
df.head()

,battery_power,blue,clock_speed,dual_sim,fc,four_g,int_memory,m_dep,mobile_wt,n_cores,...,px_height,px_width,ram,sc_h,sc_w,talk_time,three_g,touch_screen,wifi,price_range
0,842,0,2.2,0,1,0,7,0.6,188,2,...,20,756,2549,9,7,19,0,0,1,1
1,1021,1,0.5,1,0,1,53,0.7,136,3,...,905,1988,2631,17,3,7,1,1,0,2
2,563,1,0.5,1,2,1,41,0.9,145,5,...,1263,1716,2603,11,2,9,1,1,0,2
3,615,1,2.5,0,0,0,10,0.8,131,6,...,1216,1786,2769,16,8,11,1,0,0,2
4,1821,1,1.2,0,13,1,44,0.6,141,2,...,1208,1212,1411,8,2,15,1,1,0,1

# read text file in pandas

In [18]:
data = list(open('/examples/ex3.txt'))
print(data)
# use spaces (one or more ) as delimiter 
#result = pd.read_table('examples/ex3.txt', sep='\s+')
#result

['            A         B         C\n', 'aaa -0.264438 -1.026059 -0.619500\n', 'bbb  0.927272  0.302904 -0.032399\n', 'ccc -0.264273 -0.386314 -0.217601\n', 'ddd -0.871858 -0.348382  1.100491\n']

In [19]:
# use spaces (one or more ) as delimiter 

result = pd.read_table('/examples/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [20]:
df = pd.read_csv('/examples/ex4.csv') #skiprows=[0, 2, 3])
df

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [22]:
df = pd.read_csv('/examples/ex4.csv', skiprows=[0, 2, 3])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

# JSON Data
- short for JavaScript Object Notation

In [23]:
data = pd.read_json('/examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [24]:
js = pd.read_json("/json/hy.json")
print(js)
js.head()

                                             నెహెమ్యా
1   {'1': '
 హకల్యా కుమారుడైన నెహెమ్యాయొక్క చర్యలు...
10  {'1': '
 మేము ఒప్పుకొని చెప్పినదానినిబట్టి ఒక ...
11  {'1': '
 జనుల అధికారులు యెరూషలేములో నివాసము చే...
12  {'1': '
 షయల్తీయేలు కుమారుడైన జెరుబ్బాబెలుతో క...
13  {'1': '
 ఆ దినమందు వారు మోషేగ్రంథము జనులకుచదివ...
2   {'1': '
 అటుతరువాత అర్తహషస్త రాజు ఏలుబడికాలమున...
3   {'1': '
 ప్రధానయాజకుడైన ఎల్యాషీబును అతని సహోదర...
4   {'1': '
 మేము గోడ కట్టుచున్న సమాచారము విని సన్...
5   {'1': '
 తమ సహోదరులైన యూదుల మీద జనులును వారి భ...
6   {'1': '
 నేను ఇంకను గుమ్మములకు తలుపులు నిలుపకమ...
7   {'1': '
 నేను ప్రాకారమును కట్టి తలుపులు నిలిపి...
8   {'1': '
 ఏడవ నెల రాగా ఇశ్రాయేలీయులు తమ పట్టణము...
9   {'1': '
 ఈ నెల యిరువది నాలుగవ దినమందు ఇశ్రాయేల...

                                             నెహెమ్యా
1   {'1': '
 హకల్యా కుమారుడైన నెహెమ్యాయొక్క చర్యలు...
10  {'1': '
 మేము ఒప్పుకొని చెప్పినదానినిబట్టి ఒక ...
11  {'1': '
 జనుల అధికారులు యెరూషలేములో నివాసము చే...
12  {'1': '
 షయల్తీయేలు కుమారుడైన జెరుబ్బాబెలుతో క...
13  {'1': '
 ఆ దినమందు వారు మోషేగ్రంథము జనులకుచదివ...

# XML and HTML: Web data loading in to dataframe

## Downloading the packages

In [1]:
# ! conda install -c anaconda beautifulsoup4 
# ! htconda install -c anaconda html5lib
# ! pip install lxml

In [1]:
import pandas as pd
tables = pd.read_html('/examples/fdic_failed_bank_list.html')
# tables variable type is not dataframe, its list
print(type(tables))
print(len(tables))

<class 'list'>
1

In [2]:
fa_df = tables[0]
type(fa_df)

pandas.core.frame.DataFrame

In [3]:
fa_df.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [4]:
failures_df = tables[0]

print(type(failures_df))
print(failures_df.shape)

<class 'pandas.core.frame.DataFrame'>
(547, 7)

In [5]:
# warning: data is bit lengthy in this data frame
print(failures_df.columns)
len(failures_df)
#print(failures_df["City"].head())
#print(failures_df["Bank Name"].head())
#print(failures_df.head())

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

547

In [45]:
print(failures_df["City"].head())
#print(failures_df["Bank Name"].head())
#print(failures_df.head())

0           Mulberry
1           Woodbury
2    King of Prussia
3            Memphis
4          Milwaukee
Name: City, dtype: object

In [6]:
print(failures_df["Bank Name"].head())

0                     Allied Bank
1    The Woodbury Banking Company
2          First CornerStone Bank
3              Trust Company Bank
4      North Milwaukee State Bank
Name: Bank Name, dtype: object

In [7]:
print(failures_df.head())

                      Bank Name             City  ST   CERT  \
0                   Allied Bank         Mulberry  AR     91
1  The Woodbury Banking Company         Woodbury  GA  11297
2        First CornerStone Bank  King of Prussia  PA  35312
3            Trust Company Bank          Memphis  TN   9956
4    North Milwaukee State Bank        Milwaukee  WI  20364

                 Acquiring Institution        Closing Date       Updated Date
0                         Today's Bank  September 23, 2016  November 17, 2016
1                          United Bank     August 19, 2016  November 17, 2016
2  First-Citizens Bank & Trust Company         May 6, 2016  September 6, 2016
3           The Bank of Fayette County      April 29, 2016  September 6, 2016
4  First-Citizens Bank & Trust Company      March 11, 2016      June 16, 2016

# Reading Microsoft Excel Files

In [9]:
import pandas as pd

xlsx = pd.ExcelFile('/examples/ex1.xlsx')
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo